app/controllers/comments_controller.rb

    def index
        render json: Comment.all
---
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.create!(comment_params)
---
INSERT INTO "comments" ("user_id", "listing_id", "commenttext", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["listing_id", 1], ["commenttext", "jsdhljsadhf"], ["created_at", "2022-06-06 01:23:17.243411"], ["updated_at", "2022-06-06 01:23:17.243411"]]

    def destroy
        comment = find_comment
        comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 16]]

    def find_comment
        Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]