app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
SELECT "listings".* FROM "listings" WHERE "listings"."identity_id" IN (?, ?) AND "listings"."service_id" = ?  [[nil, 3], [nil, 3], ["service_id", nil]]
SELECT "listings".* FROM "listings" WHERE "listings"."service_id" = ?  [["service_id", 1]]
---
    def index
        # ex: example.com/listings?identity_id=1&service_id=1&location_id=1

        listings = Listing.where(nil)
        listings = listings.filter_by_identity(params[:identity_id]) if params[:identity_id].present?
        listings = listings.filter_by_service(params[:service_id]) if params[:service_id].present?
        listings = listings.filter_by_location(params[:location_id]) if params[:location_id].present?

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        listing = Listing.find(params[:id])