app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        user = User.find_by(id: session[:user_id])

INSERT INTO "users" ("username", "password", "email", "bio", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["username", "ryan"], ["password", "password"], ["email", "test@test.com"], ["bio", ""], ["avatar", ""], ["created_at", "2022-06-10 20:49:37.717971"], ["updated_at", "2022-06-10 20:49:37.717971"]]
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "samuel"], ["bio", "lorem ipsum dolor sit amet"], ["updated_at", "2022-07-15 01:18:58.713535"], ["id", 1]]
---
    def update
        user = User.find_by!(id: params[:id])
        user.update(update_user_params)